const data = [
    { id: 1, title: "آموزش جاوااسکریپت", desc: "آموزش جاوااسکریپت (js) از صفر تا صد با بیان مباحث مقدماتی تا پیشرفته به همراه مدرسین مجرب در مجموعه آموزشی راکت", time: "۸" },
    { id: 2, title: "طراحی سایت", desc: "آموزش طراحی سایت صفر تا صد پروژه محور به صورت کامل را از طریق مدرسین مجرب مجموعه آموزشی راکت یاد بگیرید.", time: "۱۲" },
    { id: 3, title: "آموزش لاراول", desc: "لاراول پر استفاده‌ترین فریمورک زبان برنامه نویسی PHP بوده و در سال‌های اخیر توسط شرکت‌ها و استارتاپ‌های بسیار زیادی مورد...", time: "۱۲" },
    { id: 4, title: "آموزش PHP", desc: "PHP محبوب‌ترین زبان برنامه نویسی حوزه وب است. بیش از ۵۰ درصد وبسایت‌های دنیا با استفاده از این زبان و تکنولوژی های مربوط...", time: "۹" },
    { id: 5, title: "آموزش React", desc: "React محبوب‌ترین فریمورک توسعه رابط کاربری و اپلیکیشن‌های SPA است که توسط شرکت فیسبوک ایجاد شده است. React از زبان جاوا...", time: "۸" },
]
$(document).ready(function () {
    data.forEach(element => {
        const slide = `
        <div class="swiper-slide">
        <div class="top">
            <div>
                <div class="top-right">
                    <svg class="w-30 h-30 text-black" xmlns="http://www.w3.org/2000/svg"
                        viewBox="0 0 42.418 30.106">
                        <g id="javascript-js-seeklogo.com" transform="translate(-67.311 -116.153)">
                            <path fill="currentColor"
                                d="M67.311,141.76l4.924-2.98c.95,1.684,1.814,3.109,3.887,3.109,1.987,0,3.24-.777,3.24-3.8v-20.56H85.41v20.646c0,6.263-3.671,9.114-9.028,9.114a9.385,9.385,0,0,1-9.071-5.529"
                                transform="translate(0 -1.03)"></path>
                            <path fill="currentColor"
                                d="M152.381,140.082l4.924-2.851c1.3,2.117,2.981,3.672,5.961,3.672,2.506,0,4.1-1.253,4.1-2.981,0-2.073-1.641-2.808-4.406-4.017l-1.511-.648c-4.363-1.857-7.257-4.19-7.257-9.114,0-4.535,3.456-7.991,8.855-7.991,3.844,0,6.609,1.339,8.6,4.838l-4.708,3.024c-1.037-1.857-2.159-2.591-3.887-2.591a2.631,2.631,0,0,0-2.894,2.591c0,1.814,1.123,2.548,3.715,3.672l1.512.648c5.14,2.2,8.034,4.449,8.034,9.5,0,5.443-4.276,8.423-10.021,8.423-5.615,0-9.243-2.678-11.014-6.177"
                                transform="translate(-63.687)"></path>
                        </g>
                    </svg>
                </div>
                <div class="top-left">
                    <svg class="ml-2" width="25" height="26" viewBox="0 0 25 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <circle opacity="0.15" cx="13.0035" cy="14.2262" r="8.07682" transform="rotate(-36.651 13.0035 14.2262)" fill="#3B82F6"></circle>
                        <path d="M3.15389 7.70712C7.35899 10.1461 7.88486 10.1461 12.0899 7.70712C16.295 5.26812 16.295 5.26812 12.0899 2.82914C7.88486 0.390149 7.35899 0.390142 3.15389 2.82914C1.05134 4.04863 6.10352e-05 4.65838 6.10352e-05 5.26813V10.7559C6.10352e-05 11.0926 0.273054 11.3656 0.609809 11.3656C0.946563 11.3656 1.21956 11.0926 1.21956 10.7559L1.21956 6.77631C1.21956 6.67967 1.32672 6.62118 1.40856 6.67255C1.87465 6.96515 2.45643 7.30259 3.15389 7.70712Z" fill="#3B82F6"></path>
                        <path d="M3.15389 8.31691C7.35899 10.7559 7.88486 10.7559 12.0899 8.31691L12.3298 8.17775C12.5202 8.06725 12.7602 8.18843 12.7742 8.4081C12.7953 8.74004 12.8048 9.11436 12.8048 9.53637C12.8048 12.5851 11.5853 13.1949 7.60095 13.1949C3.35013 13.1949 2.43905 12.5851 2.43905 9.53637C2.43905 9.11456 2.44809 8.74039 2.46848 8.40857C2.48201 8.18842 2.72242 8.06653 2.91317 8.17725L3.15389 8.31691Z" fill="#3B82F6"></path>
                    </svg>
                    <span id="time">دوره ${element.time}شامل</span>
                </div>
            </div>
            <a href="" id="title">${element.title}</a>
            <p class="" id="description">${element.desc}</p>
        </div>
        <div class="bottom">
            <a href="">
                مشاهده اطلاعات مسیریادگیری 
                <svg class="mr-1" width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fill="currentColor" opacity="0.4" d="M16.0371 11.2149L19.7925 10.8828C20.6352 10.8828 21.3185 11.5727 21.3185 12.4237C21.3185 13.2746 20.6352 13.9646 19.7925 13.9646L16.0371 13.6325C15.376 13.6325 14.84 13.0913 14.84 12.4237C14.84 11.755 15.376 11.2149 16.0371 11.2149Z"></path>
                    <path fill="currentColor" d="M3.42647 11.2759C3.48516 11.2166 3.70443 10.9662 3.91042 10.7582C5.11199 9.45544 8.24938 7.3252 9.89061 6.67327C10.1398 6.56928 10.7699 6.34787 11.1077 6.33221C11.43 6.33221 11.7378 6.40714 12.0313 6.55474C12.3979 6.76162 12.6902 7.08814 12.8519 7.47281C12.9549 7.73895 13.1166 8.53849 13.1166 8.55302C13.2772 9.42636 13.3647 10.8465 13.3647 12.4165C13.3647 13.9105 13.2772 15.2725 13.1454 16.1604C13.131 16.176 12.9693 17.1679 12.7932 17.5078C12.4709 18.1296 11.8408 18.5142 11.1664 18.5142H11.1077C10.668 18.4997 9.74443 18.1139 9.74443 18.1005C8.19068 17.4486 5.1275 15.4212 3.89602 14.0737C3.89602 14.0737 3.54829 13.7271 3.39767 13.5113C3.1629 13.2004 3.04551 12.8157 3.04551 12.431C3.04551 12.0016 3.17729 11.6024 3.42647 11.2759Z"></path>
                </svg>
            </a>
        </div>
    </div>
        `
  $(".swiper-wrapper").append(slide);
    });
    const pagination = $(".swiper-pagination");
    $(".mySwiper").append(pagination);

    var swiper = new Swiper(".mySwiper", {
        slidesPerView: 3,
        centeredSlides: false,
        spaceBetween: 25,
        grabCursor: false,
        pagination: {
          el: ".swiper-pagination",
          clickable: true,
        },
      });
});


